-----------------------------------------------------------
-- 刪除表內所有資料
DELETE FROM [dbo].[products];
-- 重置自增 ID
DBCC CHECKIDENT ('[dbo].[products]', RESEED, 0);
-----------------------------------------------------------
INSERT INTO [dbo].[products] ([product_name], [price], [category], [photo])
VALUES
    (N'玉子燒壽司', 40, N'壽司', NULL),
    (N'柚子胡椒長鰭鮪壽司', 40, N'壽司', NULL),
    (N'鹽味牛排壽司', 40, N'壽司', NULL),
    (N'鮪魚壽司', 40, N'壽司', NULL),
    (N'醃漬鮪魚壽司', 40, N'壽司', NULL),
    (N'鮮蝦壽司', 40, N'壽司', NULL),
    (N'甜蝦壽司', 40, N'壽司', NULL),
    (N'酪梨鮮蝦壽司', 40, N'壽司', NULL),
    (N'生鮮蝦壽司', 40, N'壽司', NULL),
    (N'花枝壽司', 40, N'壽司', NULL),

    (N'青森產小帆立貝壽司', 40, N'壽司', NULL),
    (N'清蒸北寄貝壽司', 40, N'壽司', NULL),
    (N'鮭魚壽司', 40, N'壽司', NULL),
    (N'炙燒起司鮭魚壽司', 40, N'壽司', NULL),
    (N'炙烤鮭魚肚壽司', 40, N'壽司', NULL),
    (N'蘿蔔泥炙烤鮭魚肚壽司', 40, N'壽司', NULL),
    (N'鹽醋漬鯖魚壽司', 40, N'壽司', NULL),
    (N'厚切炙烤鯖魚壽司', 40, N'壽司', NULL),
    (N'竹筴魚壽司', 40, N'壽司', NULL),
    (N'赤蝦壽司', 40, N'壽司', NULL),

    (N'麻辣赤蝦壽司', 40, N'壽司', NULL),
    (N'烏賊壽司', 40, N'壽司', NULL),
    (N'極上蟹肉棒壽司', 40, N'壽司', NULL),
    (N'甜醬烤牛肉壽司', 40, N'壽司', NULL),
    (N'豆皮壽司', 40, N'壽司', NULL),
    (N'炙燒明太子鮮蝦壽司', 60, N'壽司', NULL),
    (N'日本產貝柱壽司', 60, N'壽司', NULL),
    (N'極上鰻魚壽司', 60, N'壽司', NULL),
    (N'鮮蝦3貫', 60, N'壽司', NULL),
    (N'大切生鮭魚壽司', 60, N'壽司', NULL),

    (N'黑鮪魚中腹壽司', 60, N'壽司', NULL),
    (N'黑鮪魚大腹壽司', 80, N'壽司', NULL),
    (N'沙丁魚壽司', 40, N'壽司', NULL),
    (N'玉米沙拉軍艦', 40, N'軍艦', NULL),
    (N'鮪魚沙拉軍艦', 40, N'軍艦', NULL),
    (N'納豆軍艦', 40, N'軍艦', NULL),
    (N'蟹肉軍艦', 40, N'軍艦', NULL),
    (N'鮭魚卵軍艦', 40, N'軍艦', NULL),
    (N'北海道漬鯡魚卵軍艦', 40, N'軍艦', NULL),
    (N'飛魚卵軍艦', 40, N'軍艦', NULL),

    (N'蟹膏軍艦', 40, N'軍艦', NULL),
    (N'鮟鱇魚肝軍艦', 40, N'軍艦', NULL),
    (N'甜蝦軍艦', 40, N'軍艦', NULL),
    (N'鱈魚子沙拉軍艦', 40, N'軍艦', NULL),
    (N'蔥花鮪魚軍艦', 40, N'軍艦', NULL),
    (N'小黃瓜卷', 40, N'壽司卷', NULL),
    (N'鐵火卷', 40, N'壽司卷', NULL),
    (N'炸蝦酪梨卷', 40, N'壽司卷', NULL),
    (N'炸物拼盤', 100, N'炸物', NULL),
    (N'黃金脆薯', 50, N'炸物', NULL),

    (N'壽司人氣套餐', 160, N'套餐', NULL),
    (N'壽司鮭魚套餐', 200, N'套餐', NULL),
    (N'壽司8貫套餐', 160, N'套餐', NULL),
    (N'壽司10貫套餐', 200, N'套餐', NULL),
    (N'壽司12貫套餐', 280, N'套餐', NULL)
